In [43]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

## Series

In [9]:
obj2 = pd.Series([1, 2, 3, 4], index=['d', 'b', 'a', 'c'])

In [10]:
obj2[obj2>2]

a    3
c    4
dtype: int64

In [11]:
'b' in obj2

True

In [12]:
'h' in obj2

False

In [13]:
obj2.name = 'values'

In [15]:
obj2.index.name = 'index'

## DataFrame

In [17]:
obj2

index
d    1
b    2
a    3
c    4
Name: values, dtype: int64

In [18]:
data = {'state':['Ohio', 'Nevada', 'California'],
        'year' :[2000, 2001, 2002],
        'pop'  :[1.5, 1.7, 2.0]}

In [20]:
df = pd.DataFrame(data)

## Swap the order of the columns in the dataframe

In [22]:
pd.DataFrame(df, columns=['pop', 'year', 'state'])

   pop  year       state
0  1.5  2000        Ohio
1  1.7  2001      Nevada
2  2.0  2002  California

## Add a new columns based on existing columns

In [24]:
df['eastern'] = df.state == 'Ohio'

In [25]:
df

        state  year  pop  eastern
0        Ohio  2000  1.5     True
1      Nevada  2001  1.7    False
2  California  2002  2.0    False

## Nested dict of dicts

In [26]:
pop = {'Nevada':{2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2002: 3.6}}

In [28]:
pop_df = pd.DataFrame(pop)

In [29]:
pop_df

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   NaN
2002     2.9   3.6

In [31]:
pop_df.index.name = 'Years'

In [32]:
pop_df

       Nevada  Ohio
Years
2000      NaN   1.5
2001      2.4   NaN
2002      2.9   3.6

In [33]:
pop_df.values

array([[nan, 1.5],
       [2.4, nan],
       [2.9, 3.6]])

In [36]:
pop_df

       Nevada  Ohio
Years
2000      NaN   1.5
2001      2.4   NaN
2002      2.9   3.6

In [37]:
2001 in pop_df.index

True

## Some index methods and properties

### is_monotonic

In [40]:
pop_df.index.is_monotonic

True

In [41]:
obj2.index.is_monotonic

False

### Reindex more succintly by label-indexing with loc

In [44]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                     index = ['a', 'c', 'd'],
                     columns = ['Ohio', 'Texas', 'California'])

In [45]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [46]:
states = ['Texas', 'Utah', 'California']

In [63]:
frame = frame.loc[['a', 'b', 'c', 'd'], states]
# As we can see this loc function to execute as the reindex will
# no longer be working, so stick with the reindex function.

/Users/miaoyuesun/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

In [64]:
frame

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [67]:
frame.fillna(method='ffill', inplace=True)

In [69]:
frame

   Texas  Utah  California
a    1.0   NaN         2.0
b    1.0   NaN         2.0
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [73]:
frame.drop(['a', 'b'], axis = 0)

   Texas  Utah  California
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [74]:
frame.drop(['Texas', 'Utah'], axis=1)

   California
a         2.0
b         2.0
c         5.0
d         8.0

In [76]:
frame > 1

   Texas   Utah  California
a  False  False        True
b  False  False        True
c   True  False        True
d   True  False        True

## Selection with loc and iloc

In [79]:
frame

   Texas  Utah  California
a    1.0   NaN         2.0
b    1.0   NaN         2.0
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [87]:
# The first part inside a loc is for choosing indices, the second is for
# for choosing columns.

# Let's first try 'loc'
frame.loc[['a', 'd'], ['California']]

   California
a         2.0
d         8.0

In [92]:
# Then let's try 'iloc':

# Still, the first is for choosing row indices and the second
# for choosing columns 
frame.iloc[[1], [2]]

   California
b         2.0

## Integer Indexes

In [93]:
ser = pd.Series(np.arange(3))

In [94]:
ser

0    0
1    1
2    2
dtype: int64

In [96]:
# Error as we will get here:
ser[-1]

KeyError: -1

In [95]:
ser2 = pd.Series(np.arange(3), index = ['a', 'b', 'c'])

In [98]:
# So here as long as the index is not numbers that confuses 
# pandas any more, it will be fine.
ser2[-1]

2